[
  {
    "stage": {
      "passConditions": [
        { "trigger": "narrator-text-read" }
      ]
    },
    "narrator": {
      "text": [
        "Hi there! I'm Qitty, the Schrodinger's cat",
        "สวัสดีจ้า! ฉันชื่อคิตตี้ เป็นแมวของชโรดิงเจอร์"
      ]
    },
    "composer": {
      "isDisplay": false,
      "allowMeasure": false,
      "allowReset": false
    }
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "narrator-text-read" }
      ]
    },
    "narrator": {
      "text": [
        "Quantum world might sound scary to you. But don't worry because I'm here to help!",
        "โลกของควอนตัมอาจจะฟังดูน่ากลัวนะ แต่ไม่ต้องห่วงเพราะฉันจะช่วยเธอเอง!"
      ]
    }
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "narrator-text-read" }
      ]
    },
    "narrator": {
      "text": [
        "Computer is very important to us nowaday, but there are still many complex problem that can’t be solved by these computer.",
        "คอมพิวเตอร์สำคัญต่อพวกเรามากในปัจจุบัน แต่ว่าก็ยังมีปัญหาทางการคำนวณหลายอย่างที่ซับซ้อนเกินกว่าจะใช้คอมพิวเตอร์เหล่านี้หาคำตอบ"
      ]
    }
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "narrator-text-read" }
      ]
    },
    "narrator": {
      "text": [
        "A new way of computing is needed. So quantum computing was invented.",
        "เราเลยจำเป็นต้องหาวิธีการคำนวนทางคอมพิวเตอร์แบบใหม่ การคำนวณเชิงควอนตัมจึงถูกคิดค้นขึ้น"
      ]
    }
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "narrator-text-read" }
      ]
    },
    "narrator": {
      "text": [
        "In classical computer, smallest unit to store data is bit, which can be either 0 or 1 state.",
        "คอมพิวเตอร์ในปัจจุบันเก็บข้อมูลในหน่วยที่เล็กที่สุดที่เรียกว่า บิท (Bit) ซึ่งสภาวะของบิทนั้นเป็นได้แค่ 0 หรือ 1 เท่านั้น"
      ]
    },
    "dispatch": [
      { "action": "playCutscene", "payload": "bitScene" }
    ]
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "narrator-text-read" }
      ]
    },
    "narrator": {
      "text": [
        "So the only way that we can change bit state is fliping it between 0 and 1 (as you can see the point on top and bottom of the sphere)",
        "เราจึงสามารถเปลี่ยนสภาวะของบิทได้เพียงแบบเดียว คือการสลับสภาวะระหว่าง 0 และ 1 (ตามที่เธอเห็นจุดตรงด้านบนสุดและล่างสุดของทรงกลม)"
      ]
    }
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "narrator-text-read" }
      ]
    },
    "narrator": {
      "text": [
        "But for quantum computer, we use Qubit which can be represented with a sphere.",
        "แต่สำหรับเครื่องควอนตัมคอมพิวเตอร์นั้น เราใช้ คิวบิท (Qubit) ซึ่งเธอสามารถจินตนาการได้ว่ามันคือทรงกลม"
      ]
    },
    "dispatch": [
      { "action": "playCutscene", "payload": "qubitScene" }
    ]
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "narrator-text-read" }
      ]
    },
    "narrator": {
      "text": [
        "Qubit state can be 0, 1 and also any point in between on the sphere. Take a look at the point on the sphere!",
        "สภาวะของคิวบิทสามารถเป็นได้ทั้ง 0, 1 และจุดใดก็ได้ที่อยู่บนทรงกลม ลองดูจุดบนทรงกลมตอนนี้สิ!"
      ]
    }
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "narrator-text-read" }
      ]
    },
    "narrator": {
      "text": [
        "We can change the qubit state by rotating it around the sphere in any angle and direction.",
        "เราสามารถเปลี่ยนสภาวะของคิวบิทได้ด้วยการหมุนจุดดังกล่าวไปรอบๆ ทรงกลม ด้วยมุมเท่าใดและทิศทางไหนก้ได้"
      ]
    }
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "narrator-text-read" }
      ]
    },
    "narrator": {
      "text": [
        "Operators that rotate qubit state are called “Quantum Gates”",
        "เราเรียกตัวดำเนินการที่ทำการเปลี่ยนสภาวะของคิวบิทว่า ตัวดำเนินการทางควอนตัม (Quantum Gates)"
      ]
    }
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "narrator-text-read" }
      ]
    },
    "narrator": {
      "text": [
        "This is \"Qubit Composer\" where you can apply basic gates to the qubit.",
        "นี่คือ Qubit Composer ที่ที่เธอสามารถใช้ตัวดำเนินการทางควอนตัมพื้นฐานกับคิวบิทได้"
      ]
    },
    "composer": {
      "isDisplay": true,
      "availableGates": ["h"]
    },
    "dispatch": [
      { "action": "clearCutscene" }
    ]
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "composer-gate-preview", "parameter": "h" }
      ]
    },
    "narrator": {
      "text": [
        "You can tap gate icons once to see the description on the screen and effect on the sphere",
        "เธอสามารถแตะที่ตัวดำเนินการหนึ่งครั้ง เพื่อดูรายละเอียดของตัวดำเนินการบนหน้าจอและผลลัพท์ที่จะเกิดขึ้นบททรงกลม"
      ]
    }
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "composer-gate-push", "parameter": "h" }
      ]
    },
    "narrator": {
      "text": [
        "And you can tap it again to apply the gate to the qubit",
        "และเธอสามารถกดที่ตัวดำเนินการเดิมซ้ำอีกครั้ง เพื่อใช้ตัวดำเนินการดังกล่าวกับคิวบิท"
      ]
    }
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "narrator-text-read" }
      ]
    },
    "narrator": {
      "text": [
        "Look at the sphere, now qubit is neither 0 or 1 but in between. We called this state as a “Superposition”",
        "ลองดูที่ทรงกลมสิ! ตอนนี้สภาวะของคิวบิทไม่ใช่ 0 หรือ 1 แต่กลับอยู่ตรงกลาง เราเรียกสภาวะที่จุดนี้ว่า การทับซ้อนของคลื่น (Superposition)"
      ]
    }
  },
  {
    "dispatch": [
      { "action": "addChallengeMarker", "payload": ["0.7071067811865475", "-0.7071067811865475"]}
    ],
    "stage": {
      "passConditions": [
        { "trigger": "composer-gate-push", "result": ["0.7071067811865475", "-0.7071067811865475"] }
      ]
    },
    "narrator": {
      "text": [
        "Let’s try adding new gates to move qubit state toward the red blinking point!",
        "คราวนี้เธอลองเลือกใช้ตัวเนินการใหม่ๆ เพื่อเปลี่ยนสภาวะของคิวบิทไปอยู่ในจุดสีแดงที่กระพริบอยู่บททรงกลมดูสิ"
      ]
    },
    "composer": {
      "availableGates": ["h", "x", "y", "z"]
    }
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "narrator-text-read" }
      ]
    },
    "narrator": {
      "text": [
        "Well done! Now you know how to change qubit state.",
        "เยี่ยมไปเลย! ตอนนี้เธอเข้าใจวิธีในการเปลี่ยนสภาวะของคิวบิทแล้ว"
      ]
    },
    "dispatch": [
      { "action": "playCutscene", "payload": "clearScene" }
    ]
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "narrator-text-read" }
      ]
    },
    "narrator": {
      "text": [
        "But in order to get qubit value, a measurement operation needed to be applied.",
        "แต่การจะนำค่าของคิวบิทออกมาใช้นั้น เราจำเป็นต้องใช้ การวัด (Measurement) กับคิวบิท"
      ]
    },
    "dispatch": [
      { "action": "clearCutscene" }
    ]
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "narrator-text-read" }
      ]
    },
    "narrator": {
      "text": [
        "Measurement is an indeterministic operation which make state collapse to either 0 or 1 with some probability.",
        "การวัดเป็นการดำเนินการที่ทำให้สภาวะของคิวบิทยุบตัวลง กลายเป็น 0 หรือไม่ก็ 1 ด้วยค่าความน่าจะเป็นบางอย่าง ทำให้ผลลัพธ์ไม่แน่นอน"
      ]
    }
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "composer-measure" }
      ]
    },
    "narrator": {
      "text": [
        "Let's do measurement for 1000 times on the same qubit state to see the probability of getting 0 and 1.",
        "เรามาลองทำการวัดเป็นจำนวน 1000 ครั้งบนสภาวะของคิวบิทนี้กัน เพื่อที่จะดูว่าความน่าจะเป็นที่จะได้ผลลัพธ์เป็น 0 และ 1 นั้นเป็นอย่างไร"
      ]
    },
    "composer": {
      "allowMeasure": true
    }
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "narrator-text-read" }
      ]
    },
    "narrator": {
      "text": [
        "As you can see, the equally superposition give both 0 and 1 result with equally probability.",
        "จากผลลัพธ์ที่เธอเห็น สภาวะการทับซ้อนของคลื่นที่เท่ากันให้ผลลัพธ์จากการวัดเป็น 0 และ 1 ด้วยความน่าจะเป็นที่เท่าๆ กัน"
      ]
    }
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "narrator-text-read" }
      ]
    },
    "narrator": {
      "text": [
        "That's because the chance of getting 0 and 1 is related to the distance from qubit state before a measurement.",
        "นั่นเป็นเพราะว่าความน่าจะเป็นที่จะวัดค่าได้ 0 และ 1 สัมพันธ์กับระยะห่างจากสภาวะของคิวบิทก่อนที่จะทำการวัด"
      ]
    }
  },
  
  {
    "stage": {
      "passConditions": [
        { "trigger": "narrator-text-read" }
      ]
    },
    "narrator": {
      "text": [
        "Even though quantum computer is still under development, researcher already designed quantum algorithms that can solve some particular problems with more efficientcy.",
        "ถึงแม่ว่าเครื่องควอนตัมคอมพิวเตอร์ยังคงอยู่ระหว่างการพัฒนา นักวิจัยสามารถออกแบบอัลกอลิทึมเชิงควอนตัม ที่สามารถแก้ไขปัญหาการคำนวณบางประเภทได้รวดเร็วกว่าเดิม"
      ]
    },
    "composer": {
      "isDisplay": false
    }
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "narrator-text-read" }
      ]
    },
    "narrator": {
      "text": [
        "Keep in mind that it can not replace classical computer. It was built to tackle different kind of problems which might take us to a new discovery.",
        "จำไว้นะว่ามันไม่สามารถแทนที่คอมพิวเตอร์แบบเดิมได้ หากแต่มันถูกสร้างเพื่อแก้ปัญหาที่ต่างออกไป ซึ่งอาจจะพาเราไปสู่การค้นพบอะไรที่ยิ่งใหญ่ก็ได้ในอนาคต"
      ]
    }
  },
  {
    "stage": {
      "passConditions": [
        { "trigger": "narrator-text-read" }
      ]
    },
    "narrator": {
      "text": [
        "Sound cool isn't it!? Welcome to the first step of new human kind computing era!",
        "ฟังดูเจ๋งใช่ไหมละ!? ยินดีต้อนรับเข้าสู่ก้าวแรกของการคำนวณยุคใหม่ของมวลมนุษยชาติ!"
      ]
    }
  }
]